Tekla Open API Reference for Tekla Structures 2025
FacetedBrep.InnerWires Property
 Gets the inner wires.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IDictionary<int, int[][]> InnerWires { get; }
Public ReadOnly Property InnerWires As IDictionary(Of Integer, Integer()())
	Get
Property Value
Type: IDictionary<Int32, Int32[][]>
See Also
Reference
FacetedBrep Class
Tekla.Structures.Geometry3d Namespace